---
type: MultiServerService
namespace: Autodesk.Revit.DB.ExternalService
version: 2024
members: 5
tags: [revit-api, class]
---

# MultiServerService

`Autodesk.Revit.DB.ExternalService.MultiServerService` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetActiveServerIds | — | `` |
| Method | GetActiveServerIds | 2013 | `public IList < Guid > GetActiveServerIds ()` |
| Method | SetActiveServers | — | `` |
| Method | SetServerState | 2013 | `public bool SetServerState ( Guid serverId , Document document , bool bActive )` |
| Property | ExecutionPolicy | 2013 | `public ExecutionPolicy ExecutionPolicy { get ; }` |